diy-dream/DCND/dcnd_nrf52840_board/s140/ses/main.c
                dcnd_protocol_acknowledge("MSG_RECEIVED ACKNOWLEDGE\n");
            }else{
                NRF_LOG_INFO("MSG_RECEIVED_IN_PROGRESS\n");

                char str[MAX_LINE_CHARACTER * MAX_LINE];
                memset(str, '\0', sizeof(str));
                
                //strcpy(str, p_evt->params.rx_data.p_data);
                strncpy(str, p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                
                strcat(dcnd.message, str);
                NRF_LOG_INFO("dcnd.message = %s", dcnd.message);
                NRF_LOG_INFO("str = %s", str);
                dcnd_protocol_acknowledge("MSG_RECEIVED_IN_PROGRESS ACKNOWLEDGE\n");
            } 
        }
        else if(dcnd.state == RECEIVED_DATA_IMG)
        {
            dcnd_protocol_decode(&dcnd, p_evt->params.rx_data.p_data);
            if(dcnd.message_types == STOP_TRANSFER_IMG)
            {
                NRF_LOG_INFO("IDLE_STATE\n");
                NRF_LOG_INFO("IMG_RECEIVED\n");
                dcnd.state = IDLE_STATE;
                indexImg = 0;
                NRF_LOG_INFO("Image msg = %s", imageMsg);
                EPD_DisplayFrame(&epd, imageMsg);
            }else{
                NRF_LOG_INFO("IMG_RECEIVED_IN_PROGRESS\n");

                /*char strTemp[100];
                memset(strTemp, '\0', sizeof(strTemp));

                strncpy(strTemp, p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                strcat(imageMsg, strTemp);*/

                char strTmp[2];
                //memset(strTmp, '\0', sizeof(strTmp));

                uint8_t number;

                NRF_LOG_INFO("indexImg =  %d", indexImg);

                for(int i = 0; i < (p_evt->params.rx_data.length - 1); i++){
                    strTmp[0] = p_evt->params.rx_data.p_data[i];
                    strTmp[1] = p_evt->params.rx_data.p_data[++i];

                    number = (uint8_t)strtol((const char *)&strTmp, NULL, 16);

                    imageMsg[indexImg] = number;

                    /*if(IMG_TEST[indexImg] != imageMsg[indexImg]){
                        NRF_LOG_INFO("Error IMG_TEST[%d] != imageMsg[%d]", indexImg, indexImg);
                        NRF_LOG_INFO("Error         0x%x != 0x%x", IMG_TEST[indexImg], imageMsg[indexImg]);
                        indexError++;
                        if(indexError > 64){
                            APP_ERROR_CHECK(NRF_ERROR_INVALID_DATA);
                        }
                    }*/
        
                    indexImg++;
                }

                NRF_LOG_INFO("Data length = %d", p_evt->params.rx_data.length);
                NRF_LOG_INFO("Data raw = %s", p_evt->params.rx_data.p_data);
                NRF_LOG_INFO("Image strTemp = %s", imageMsg);
            }  
        }
    }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_bas_init_t     bas_init;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    ble_dfu_buttonless_init_t dfus_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize DFU.
    dfus_init.evt_handler = ble_dfu_evt_handler;

    err_code = ble_dfu_buttonless_init(&dfus_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    bas_init.evt_handler          = on_bas_evt;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

