diy-dream/DCND/dcnd_nrf52840_board/s140/ses/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/*
 * TODO
 */
void output_voltage_setup(void)
{
    // Configure UICR_REGOUT0 register only if it is set to default value.
    if ((NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk) ==
        (UICR_REGOUT0_VOUT_DEFAULT << UICR_REGOUT0_VOUT_Pos))
    {
        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        NRF_UICR->REGOUT0 = (NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk)) |
                            (UICR_REGOUT0_VOUT_3V3 << UICR_REGOUT0_VOUT_Pos);

        NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren;
        while (NRF_NVMC->READY == NVMC_READY_READY_Busy){}

        // System reset is needed to update UICR registers.
        NVIC_SystemReset();
    }
}


static bool pin_chg_is_set = false;
static bool pin_pg_is_set = false;
/**@brief TODO
 */
void in_pin_chg_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    if(nrf_drv_gpiote_in_is_set(pin))
    {
        pin_chg_is_set = true;
        NRF_LOG_INFO("PIN CHG 1 TTL");

        if(!pin_pg_is_set)
        {
            EPD_DisplayFrame(&epd, IMG_BATTERY_FULLY_CHARGE);
            NRF_LOG_INFO("Battery charge finish");
        }
    }
    else
    {
        pin_chg_is_set = false;
        NRF_LOG_INFO("PIN CHG 0 TTL");

        if(!pin_pg_is_set)
        {
            EPD_DisplayFrame(&epd, IMG_BATTERY_CHARGE);
            NRF_LOG_INFO("Battery charge start");
        }
    }
}


/**@brief TODO
 */
void in_pin_pg_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    if(nrf_drv_gpiote_in_is_set(pin))
    {
        pin_pg_is_set = true;
        NRF_LOG_INFO("PIN PG 1 TTL");
    }
    else
    {
        pin_pg_is_set = false;
        NRF_LOG_INFO("PIN PG 0 TTL");
    }
}


/**@brief TODO
 */
void bq24090_init(void)
{
    ret_code_t err_code;

    // Configure PIN_CHG in input of BQ24090.
    nrf_drv_gpiote_in_config_t pin_chg_in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);
    pin_chg_in_config.pull = NRF_GPIO_PIN_NOPULL;
    
    err_code = nrf_drv_gpiote_in_init(PIN_CHG, &pin_chg_in_config, in_pin_chg_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(PIN_CHG, true);

    // Configure PIN_PG in input of BQ24090.
    nrf_drv_gpiote_in_config_t pin_pg_in_config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);
    pin_pg_in_config.pull = NRF_GPIO_PIN_NOPULL;
    
    err_code = nrf_drv_gpiote_in_init(PIN_PG, &pin_pg_in_config, in_pin_pg_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(PIN_PG, true);
  
    // Configure PIN_ISET2 in output of BQ24090.
    nrf_drv_gpiote_out_config_t pin_iset2_out_config = GPIOTE_CONFIG_OUT_SIMPLE(false);
    err_code = nrf_drv_gpiote_out_init(PIN_ISET2, &pin_iset2_out_config);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_out_set(PIN_ISET2);
}


/**@brief TODO
 */
void in_pin_clr_screen_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    ret_code_t err_code;

    if(!btn_timer_is_set){
        err_code = app_timer_start(m_push_btn_timer_id, 5000, NULL); //2s 
        APP_ERROR_CHECK(err_code);

        btn_timer_is_set = true;
    }
}


/**@brief TODO
 */
void clear_button_init(void)
{
    ret_code_t err_code;

    // Configure PIN_CLR_SCREEN in input.
    nrf_drv_gpiote_in_config_t pin_clr_screen_in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(false);
    pin_clr_screen_in_config.pull = NRF_GPIO_PIN_PULLUP;
    
    err_code = nrf_drv_gpiote_in_init(PIN_CLR_SCREEN, &pin_clr_screen_in_config, in_pin_clr_screen_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(PIN_CLR_SCREEN, true);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    if (NRF_POWER->MAINREGSTATUS &
       (POWER_MAINREGSTATUS_MAINREGSTATUS_High << POWER_MAINREGSTATUS_MAINREGSTATUS_Pos))
    {
        output_voltage_setup();
    }

    // Initialize.
    log_init();

    // Initialize the async SVCI interface to bootloader before any interrupts are enabled.
    err_code = ble_dfu_buttonless_async_svci_init();
    APP_ERROR_CHECK(err_code);

    timers_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    adc_configure();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("DCND started");
    NRF_LOG_FLUSH();

    advertising_start();

    dcnd_init(&dcnd);

