diy-dream/DCND/dcnd_nrf52840_board/s140/ses/main.c
    if (EPD_Init(&epd) != 0) {
      NRF_LOG_INFO("e-Paper init failed");      
      return -1;
    }else{
      NRF_LOG_INFO("e-Paper init sucess");
    }  

    /* Battery Lipo Charger */
    bq24090_init();

    /*TODO*/
    clear_button_init();

    Paint_Init(&paint, frame_buffer, epd.width, epd.height);
    Paint_Clear(&paint, UNCOLORED);

    EPD_DisplayFrame(&epd, IMG_PAS_DE_NOUVEAU_MSG);

    NRF_LOG_INFO("DCND enter in idle state");

    //TEST 1 (Text too big for the screen)
    //print_character_on_screen("Un texte est un ensemble coherent d'enonces qui forme une unite de sens et qui a une intention communicative (le but est de transmettre un message). L'adjectif litteraire, a son tour, est associe a la litterature, soit l'ensemble des expertises visant à lire et à ecrire correctement.");

    //TEST2 (Text 4 lines, 3 full lines and 1 last line with 3 character)
    //print_character_on_screen("Un texte est un ensemble coherent d'enonces qui forme une unite de sens ");

    //TEST3 (Text 4 lines full lines)
    //print_character_on_screen("Un texte est un ensemble coherent d'enonces qui forme une unite de sens et qui a une intenti");

    //TEST (Text 4 full screen message)
    //print_character_on_screen("Un texte est un ensemble coherent d'enonces qui forme une unite de sens et qui a une intention communicative (le but est de transmettre un message). L'adjectif litteraire, a son tour, est associe a la litter");


    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}

/** @} */